{
  "properties": {
    "displayName": "Demo Product",
    "description": "The Demo Product encompasses a collection of APIs meticulously designed for demonstrations and proof-of-concept scenarios. These APIs serve as powerful tools to showcase the capabilities, functionality, and versatility of our software solutions. Developers can seamlessly integrate these APIs into their mock applications, presentations, and workshops, providing a tangible glimpse of the value our products bring to the table.",
    "approvalRequired": false,
    "state": "published",
    "subscriptionRequired": true,
    "terms": "API Access Agreement\n\n1. Definitions\n\nAPI: Refers to the application programming interface provided by our tech firm.\nUser: Any individual or entity accessing our APIs.\n2. Acceptance of Terms\n\nBy accessing our APIs, the user agrees to comply with these terms and conditions.\nIf the user does not agree, they must refrain from using our APIs.\n3. Permitted Use\n\nThe user may access and utilize our APIs solely for legitimate business purposes related to their software development, integration, or research.\nUnauthorized use, including reverse engineering, scraping, or any activity that harms our systems, is strictly prohibited.\n4. Authentication and Security\n\nThe user shall obtain valid API keys or tokens through our designated channels.\nThe user is responsible for safeguarding their credentials and ensuring secure transmission of data.\n5. Rate Limits and Quotas\n\nThe user shall adhere to rate limits and quotas specified in our API documentation.\nExcessive requests may result in temporary or permanent suspension of API access.\n6. Data Usage and Privacy\n\nThe user acknowledges that our APIs may process data, including personal information.\nCompliance with applicable data protection laws (e.g., GDPR) is mandatory.\nThe user shall not misuse or disclose sensitive data obtained through the APIs.\n7. Intellectual Property\n\nOur APIs and associated documentation are protected by intellectual property rights.\nThe user receives a limited, non-exclusive license to use the APIs solely as intended.\nModifications, sublicensing, or unauthorized distribution are prohibited.\n8. Indemnification\n\nThe user agrees to indemnify and hold our tech firm harmless from any claims arising out of API usage.\nThis includes legal fees, damages, and liabilities incurred due to the user’s actions.\n9. Termination\n\nWe reserve the right to suspend or terminate API access at our discretion.\nUpon termination, the user must cease API usage and return any confidential information.\n10. Governing Law\n\nThese terms shall be governed by the laws of the jurisdiction where our tech firm is incorporated.\nPlease note that this is a concise summary, and users are encouraged to review the complete API documentation for detailed terms. Should you have any specific legal inquiries, feel free to consult our legal department. "
  }
}